---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial
source: html/f4ed9e81-33f5-b847-974d-bcbf37fe0ad8.htm
---
# EnergyAnalysisMaterial Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.